# RasterSheetheight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterSheetheight Property
ParameterTypeId Class See Also
---
"Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterSheetheight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterSheetheight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterSheetheight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace